{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "LXBlog",
	"language": "en",
	"home_page_url": "https://blog.lx862.com/",
	"feed_url": "https://blog.lx862.com/feed/feed.json",
	"description": "I am writing about my experiences as a naval navel-gazer.",
	"author": {
		"name": "LX86",
		"url": "https://lx862.com"
	},
	"items": [
		{
			"id": "https://blog.lx862.com/blog/2023-04-02-I-rebuilt-the-blog/",
			"url": "https://blog.lx862.com/blog/2023-04-02-I-rebuilt-the-blog/",
			"title": "I rebuilt this blog",
			"content_html": "<p>Yes this is my new blog.\nIf it doesn't make you clear that I am not a designer then I don't know what does.</p>\n<p>You might have also noticed a few new post, as I pretty much abandoned my old blog's repo and I was writing posts on this new blog instead.<br>\nUnfortunately I was struggling to get this site to look decent (Eventually gave up) and at last it took me way longer to roll this out than I'd like to.</p>\n<p>Why rebuild? The previous site is based on Beautiful Jekyll, a blogging template that uses GitHub pages to host the blog.\nFor starters I think it's great and it makes blogging more accessible than ever. You get all your RSS feed, a proper looking blog page, comment section etc by only tweaking a few keys in the yaml file.\nHowever overtime as I &quot;attempt&quot; to add my own stuff this has became an inconsistent mess serving dozens of files that I don't even know what's it's doing. (Especially when I am not that familiar with jekyll in the first place)</p>\n<p>To put it simply, I want slightly more control over my blog and I certainly have better knowledge of JS than anything else (Yes javascript rules the world)</p>\n<p>Another reason is that I am just the sort of person who wants to plan everything ahead, be very conservative and not wanting to correct anything afterwards. My previous blog that is built with Beautiful Jekyll doesn't allow me to preview locally (Or rather you can, but it's just annoying to do), which is a very big dealbreaker.</p>\n<p>So whether you like it or not, this &quot;new blog&quot; is here to stay :)</p>\n",
			"date_published": "2023-04-02T00:00:00Z"
		}
		,
		{
			"id": "https://blog.lx862.com/blog/2023-03-29-English-Teacher-Retirement/",
			"url": "https://blog.lx862.com/blog/2023-03-29-English-Teacher-Retirement/",
			"title": "My English Teacher retired",
			"content_html": "<p>It's year-3 and we just had a new English teacher.</p>\n<p>He's sort of the more &quot;close-minded&quot; teacher, have a rather strict set of rules and are not always received by everyone.<br>\nBut in terms of actually teaching I think he does a pretty good job, often providing his own materials and pass on his experiences to ensure we can pass the subject.<br>\nAs long as you do actually listen to what's he saying then there's usually no problem.</p>\n<p>He's also one of the more senior teachers and have a strong sense of responsibility, so he generally have more says on stuff and you can pretty much take his word for it.</p>\n<p>So around a month ago he took a short break for maybe like 2 weeks, and leaves the task to the substitude teachers.<br>\nBut damn that substitude teacher rarely actually teaches stuff, having strict rules, only keep saying stuff on our book word by word then ask us what is the answer like what even is the point??? And that just left me pretty pissed off.</p>\n<p>Anyways the English teacher did return later and I was more relieved, but around 2 weeks ago he said he's &quot;taking a long break&quot; and will once again leave the rest of the task another substitude teacher for the time being.</p>\n<p>Now I should've been alerted at this point as:</p>\n<ul>\n<li>He just had a break not long ago</li>\n<li>He didn't specify the time when he returns, which is very unusual as he usually has a strong sense of responsibility</li>\n</ul>\n<p>But he just says it in a &quot;casual&quot; way, and if anything I am clearly more worried of what will be the next substitude teacher than him taking a break.</p>\n<p>As expected another substitude teacher came (Not a bad one btw) shortly after, but almost the first thing she said is &quot;Yea so you know your English teacher is retired right&quot;, and we're just like ?????.<br>\nWell... I guess he's not wrong about it being a &quot;long break&quot;, but I don't quite understand why would he not just straight up tell us.<br>\nMaybe he just want us to keep focusing on the subject rather than him retiring? I don't know but it just keeps bugging me over and over.</p>\n<p>You might think I am crazy for being such emotionally attached to a teacher, but he's really one of the few teacher that can actually teach stuff in a very good way that most student can understand properly. Either way it's also just weird to see him just leave in mid-semster on the final year, there's something incomplete about it.</p>\n<p>He did however return yesterday (Presumably to pack up the rest of his stuff at school) and I get to see him (probably one last time) when changing lessons.<br>\nHe did said some encouragement words to me, I can only wonder does he knew what the teacher told us...</p>\n",
			"date_published": "2023-03-29T00:00:00Z"
		}
		,
		{
			"id": "https://blog.lx862.com/blog/2023-03-01-I-tried-KDE-Plasma/",
			"url": "https://blog.lx862.com/blog/2023-03-01-I-tried-KDE-Plasma/",
			"title": "I tried KDE Plasma",
			"content_html": "<p>KDE Plasma is often regarded as one of the most customizable and powerful Desktop Environment and there's no doubt about it.\nSo in around January, I switched my main desktop to Debian Testing along with KDE Plasma just to get a taste of how it actually feels like.</p>\n<p>Took me a while to get this thing actually running and understand everything but well at least I've learnt a lot of stuff along the way and now we're here.</p>\n<h2 id=\"the-good\" tabindex=\"-1\">The good <a class=\"header-anchor\" href=\"https://blog.lx862.com/blog/2023-03-01-I-tried-KDE-Plasma/\">#</a></h2>\n<p>It is pretty much as &quot;advertised&quot;, just an extremely customizable and adaptable (And with that also comes with a cost of well, slightly more bugs) desktop environment.\nAs a more traditional desktop user, KDE's default workflow works well and I don't have to tinker too much to get it right, at the same time offering some comfort features hidden in piles of options. I also love KDE's Widget as they all are deeply customizable and flexible. This means I can make use of my smallish empty space on my second monitor to display informations that are relevant to me.</p>\n<p>And of course I have to mention KRunner, sometimes you just want to just run some quick terminal command, calculations, currency conversion, dictionary and spelling lookup, KRunner can do it all out of the box.<br>\nYou can also <a href=\"https://store.kde.org/browse?cat=628\">browse more KRunner Plugins/Runners</a> and see what goodies are on the shelf.\nIf you know a bit about python scripting/C++, you can also just make your own plugin to suits your need. (Although there's not alot of documentation).</p>\n<h2 id=\"ah-bugs\" tabindex=\"-1\">Ah, bugs... <a class=\"header-anchor\" href=\"https://blog.lx862.com/blog/2023-03-01-I-tried-KDE-Plasma/\">#</a></h2>\n<p>Right after the initial installation I was hit with a devastating multi-monitor bug.</p>\n<p><picture><source type=\"image/avif\" srcset=\"https://blog.lx862.com/img/qJpmNC6R3S-3833.avif 3833w\"><source type=\"image/webp\" srcset=\"https://blog.lx862.com/img/qJpmNC6R3S-3833.webp 3833w\"><img alt=\"KDE Plasma 5.26.5 with no icon, no window title\" loading=\"lazy\" decoding=\"async\" src=\"https://blog.lx862.com/img/qJpmNC6R3S-3833.jpeg\" width=\"3833\" height=\"894\"></picture></p>\n<p>Introduced in Plasma 5.26, if you start the plasma session with 2 monitor under X11, all icons across the entire shell will disappear, window title will disappear and the context menu is oversized.<br>\nThe worst part is probably the oversized context menu and it pretty much just means I can't right click anywhere.</p>\n<p>For a long time I was pretty much stuck with single monitor as Wayland works rather &quot;terribly&quot; on my machine.<br>\nHowever when Plasma 5.27 came around Wayland seems to be much smoother, along with the new multi-monitor refactor I can now comfortably switch to Wayland and finally use my second monitor. (Also my current monitor only works well with limited RGB Range, props to KDE devs for making this easy to switch under Display Settings).</p>\n<p>However Wayland also has its own set of issues (Window thumbnail on the panel may not always show, clipboard is a bit wonky etc), and for many Wayland may still not be a viable option, and this rather odd multi-monitor bug might just throws alot of new potential user away from Plasma or even Linux in general.</p>\n<p><ins>Note: The bug mentioned above has been fixed on Plasma 5.27.2</ins></p>\n<p>Unfortunately there are still more bugs waiting for me, mostly relating to random crashes (Even more so in Wayland, there's rarely a single day where I don't have to restart plasmashell), and it doesn't help that Dr Konqi keeps saying that the crash report is not useful, or doesn't even pop up at all.</p>\n<p>Some of them are packaging issues and are not caused by Plasma itself (<em>Ahem Apper</em>), but nevertheless still hinders the desktop experience.</p>\n<p>Sure some will say &quot;Plasma works flawless here&quot; but my experience unfortunately tells me otherwise, and it can get very painful especially if you're still relatively new to Linux having everything fall down on you.</p>\n<p>Now don't get me wrong, I am not trying to bash against the developer or question the direction plasma is heading. Plasma is complex software and I appreciate those who voluntarily contributes to KDE.\nI am just here documenting my experience and how one might be easily discouraged from using Plasma/Linux in general, and I sincerely hope most of them will be fixed in Plasma 6.</p>\n<h2 id=\"ux\" tabindex=\"-1\">UX <a class=\"header-anchor\" href=\"https://blog.lx862.com/blog/2023-03-01-I-tried-KDE-Plasma/\">#</a></h2>\n<p>Another issue with Plasma is that the UX can get well... a bit questionable. (UI however is absolutely fine and consistent, even if the borders are subjective).</p>\n<p>For example if you want to add an application to the Application Launcher (Start menu), the most average computer users would just drag the app from the panel to the Application Launcher.</p>\n<p>Nope that doesn't work. So I tried right clicking the empty space in the launcher, expecting that there will be a context menu that I can add/remove items, but nothing pops up either.</p>\n<p>Okay I see a &quot;settings&quot; icon on the top left, given how obviously placed it is surely I can add it from there right?</p>\n<p><picture><source type=\"image/avif\" srcset=\"https://blog.lx862.com/img/cJfqr6AC7z-668.avif 668w\"><source type=\"image/webp\" srcset=\"https://blog.lx862.com/img/cJfqr6AC7z-668.webp 668w\"><img alt=\"KDE Application Launcher, with mouse hovered over the settings icon on top right\" loading=\"lazy\" decoding=\"async\" src=\"https://blog.lx862.com/img/cJfqr6AC7z-668.png\" width=\"668\" height=\"527\"></picture></p>\n<p>Nope, it just configures the behavior of the Application Launcher, not the menu itself.</p>\n<p>I am really puzzled, so I gave a google search and turns out you need to right click the Application Launcher from the Panel (Taskbar), then you can click &quot;Edit Applications&quot;.</p>\n<p>That is just &quot;kinda&quot; hidden? Ideally it should be as follows:</p>\n<ol>\n<li>Drag and Drop</li>\n<li>If drag and drop can't be implemented due to technicial reasons, right clicking should bring up a way to Add/Edit applications.</li>\n<li>If neither of these are feasible, instead of putting the Settings button (Where the user will most likely only configure this 1 or few times), it's probably more sensible to just replace it with an Edit Application button instead?</li>\n</ol>\n<p>I think Adding and Removing application from the application launcher should be treated differently than &quot;configuring&quot; the application launcher, but rather just a part of the Application Launcher's functionality that a normal user would encounter at some point.</p>\n<p>The menu editor (KMenuEdit) is also overwhelming with all the button laid on top in the same style.\n<picture><source type=\"image/avif\" srcset=\"https://blog.lx862.com/img/Ecujv2Wrnl-1164.avif 1164w\"><source type=\"image/webp\" srcset=\"https://blog.lx862.com/img/Ecujv2Wrnl-1164.webp 1164w\"><img alt=\"KMenuEdit, an application for editing Application Launcher's item\" loading=\"lazy\" decoding=\"async\" src=\"https://blog.lx862.com/img/Ecujv2Wrnl-1164.png\" width=\"1164\" height=\"503\"></picture>\nFor example, I think some of the button like reordering items should be offloaded to the treeview item, Environment Variable and Command Line Argument could be put into &quot;Advanced&quot;, the searchbox should have an icon on the left, and a lack of tooltips doesn't help explaining to user what that option actually does.</p>\n<p>It also requires the user to save the configuration manually (Good on paper, but in practice it's not that good with something as simple as editing a start menu).</p>\n<p>There's also no indication on whether the current configuration is *modified or not, so the user would have expected it to be saved automatically, but it doesn't and you would risk losing the new configuration when the editor crashes, which has happended to me at least 3 times now.</p>\n<p>Another thing that I wished Plasma does is the handling hidden files on GUIs. (Very specific I know)\nIn most cases Plasma just ignores hidden files on the GUI. This can lead to confusion especially with dot-files where, for example, the user are trying to add a <code>.startup.sh</code> as an <strong>Autostart</strong> item. This would not be shown in the Autostart System Settings at all even if the item is added already, leading to confusions where &quot;I am unable to add my script to startup, it does nothing&quot;.</p>\n<p>This also goes for other aspects of KDE apps in general.\nFor example when adding an account in KMail <span class=\"sub\">(Yes it's not actively worked on, but given how they are shipped with the standard KDE Installation you would expect it to have better integration with Plasma and work better than other 3rd party applications)</span>, you are greeted with this screen.</p>\n<p><img src=\"https://blog.lx862.com/img/2023-03-01/kmail.png\" alt=\"KMail Add Account Wizard, with all info entered correctly. The &quot;Next&quot; button is highlighted\"></p>\n<p>Clicking the &quot;Next&quot; option will bring you into a loading screen for a split second, then bring you back to this screen with absolutely no indication on what to do, and it turns out you need to click &quot;Add Accounts&quot;.</p>\n<p>Ideally, the &quot;Add Account&quot; button should be highlighted, and the Next button should be disabled when it can't actually do anything. Better yet, get rid of the Add Account all together and do that automatically when clicking Next.</p>\n<p>Some options are also just hard to discover, for example the &quot;Show Desktop&quot; widget, to toggle between &quot;Minimize all window&quot; and &quot;Peek at Desktop&quot; you have to switch to an alternative widgets.</p>\n<p><picture><source type=\"image/avif\" srcset=\"https://blog.lx862.com/img/rsY7ZrqaWl-371.avif 371w\"><source type=\"image/webp\" srcset=\"https://blog.lx862.com/img/rsY7ZrqaWl-371.webp 371w\"><img alt=\"Plasma's Alternative Widget, with 2 options (Minimize all Windows/Show Desktop) \" loading=\"lazy\" decoding=\"async\" src=\"https://blog.lx862.com/img/rsY7ZrqaWl-371.png\" width=\"371\" height=\"279\"></picture></p>\n<p>These 2 widgets have the exact same apperance but only differs minorly in behavior. A user would try to configure this by right clicking and &quot;Configure Peek at Desktop&quot; only to find that there's no configuration available other than shortcuts. But given how other widgets also use the Configure Window to configure the behavior it should be the same in this widget as well.</p>\n<p>To be clear these UX issues isn't really a problem for existing Plasma users as they usually know the way around, and in all fairness most of them aren't located in 50 submenu so it's very straightforward once you know it, but it sort of creates a barrier for new users who are just trying Plasma out.\nSure you can Google it but the user should be able to discover these options by themselves.</p>\n<p>With that being said it seems that these UX issues are slowly being tackled on, and newly developed KDE apps are usually pretty good, along with the <a href=\"https://pointieststick.com/2022/12/09/this-week-in-kde-new-spectacle/\">redesign of Spectacle</a>, moving items to a more sensible group in System Settings it is heading towards a good direction, but there are just many of these issues across different areas, and especially with the amount of apps KDE has, it will probably take a good while for most of it to be resolved.</p>\n<h2 id=\"overall\" tabindex=\"-1\">Overall <a class=\"header-anchor\" href=\"https://blog.lx862.com/blog/2023-03-01-I-tried-KDE-Plasma/\">#</a></h2>\n<p>Plasma will remain as my primary DE on my main Desktop, it's a DE where &quot;It works very well... when it does&quot;.<br>\nFor me there's a decent amount of crashes and quirks <span class=\"sub\">(Yes I will try to report bugs whenever I can)</span> but it's still a powerful and customizable DE, with the right configuration it can appeal to lots of people.</p>\n<p>Obviously if you are new to Linux then Plasma probably won't be my choice. You're pretty much always better off with Linux Mint + Cinnamon.\nYes they don't have Wayland, looks dated by default (But theme exists), not as customizable as KDE Plasma, but it's rock stable and are generally very good just to get your feet wet before going any further.</p>\n<p>Or maybe you could also stick with an older version of Plasma and hope these nasty issues don't chase after you, although they will go out of support soon and that's not really a viable choice.</p>\n<p>I apologize if this post sounds just like me nitpicking KDE Plasma's weakness, but I really wanted to share on what a normal user may find fustrating, and what could be improved for a more pleasent experience. I do respect all KDE contributors and to get us to where we are today.</p>\n",
			"date_published": "2023-03-01T00:00:00Z"
		}
		,
		{
			"id": "https://blog.lx862.com/blog/2023-02-26-Fu-NVIDIA/",
			"url": "https://blog.lx862.com/blog/2023-02-26-Fu-NVIDIA/",
			"title": "So NVIDIA, F*** you",
			"content_html": "<p>Ever since I kinda have &quot;my own PC&quot;, my hardware is always several generations behind, whether it's CPU or GPU.\nHowever last Friday I got an NVIDIA GTX 1660 SUPER, which is going to replace my GTX 650 Ti BOOST 1GB (Coincidentally it is released almost exactly 1 decade ago).</p>\n<p>This card was actually a mining card by &lt;undisclosed member somewhere in my family tree&gt;, and it still seems to be in good condition.\nThis upgrade is also a massive upgrade and it marks the first time I am using a so called &quot;mainstream&quot; GPU card that is still well within the support period.</p>\n<p>Now the NVIDIA GTX 650 Ti BOOST has served me rather well, but the main issue is that my variants only has 1GB of VRAM. Open up a browser on Windows and you're using almost 800MB/1GB, open up any game and you're doomed to swap with the System RAM which heavily tanks the performance and are not even using the GPU to the full potential. But I've been doing less gaming lately so that is still &quot;workable&quot;.</p>\n<p>Anyways the first thing I did is just boot into Windows, as I know there (usually) won't be any problem setting up the driver there, and it did work out as planned. Within a minute the driver gets installed automatically and I am now rocking with an 1660 Super with no issues.</p>\n<p>Now it's time to reboot into Linux. I know for a fact that NVIDIA driver on Linux is a pain, but considering my old GPU haven't really gave me &quot;too&quot; much issue I thought that the worst scanario is just purging my old NVIDIA legacy driver then reinstall it with the new one.</p>\n<p>I waited, and waited, hoping I would at least see the KDE Plasma Splash Screen... wait did the screen freeze?\nThis is still within my expectations (Even if annoying), so I tried switching to another tty and remove all the NVIDIA stuff there, except that it seems my entire system just locked up and nothing works.</p>\n<p>Okay well let's reboot into recovery mode and hope it works there, but then I realized I've set my GRUB timeout to be 0s. I know that you can press &quot;Shift&quot; or &quot;Esc&quot; to force GRUB to appear, however I know this doesn't work at least under my configuration for whatever reason. Resetting the GRUB Timeout is somewhere on my todo list for a long time so I can actually boot into recovery mode when needed, but everytime I just dismiss it and finds something better to do. Well now it came back to haunt me.</p>\n<p>Well alright, at least I still have my Ventoy USB. I am going to boot into Ubuntu Live then modify the grub config there... what in the world is this?</p>\n<p><picture><source type=\"image/avif\" srcset=\"https://blog.lx862.com/img/5bOvr55mdk-1920.avif 1920w\"><source type=\"image/webp\" srcset=\"https://blog.lx862.com/img/5bOvr55mdk-1920.webp 1920w\"><img alt=\"Ubuntu Live Session, with a heavy green tint\" loading=\"lazy\" decoding=\"async\" src=\"https://blog.lx862.com/img/5bOvr55mdk-1920.jpeg\" width=\"1920\" height=\"1080\"></picture></p>\n<p>Yes it is still perfectly usable apart from the green tint, but this is already a big downgrade as none of this happens with my previous (also NVIDIA) GPU and it's just a terrible experience. Anyways I did finally get the GRUB menu to show up and entered recovery mode, and now I can finally uninstall the old NVIDIA Driver.\nAfter rebooting I am back on Plasma desktop with nouveau, which sucks in performance but are still better than the whatever NVIDIA nonsense I just had.</p>\n<p>So let's re-install the latest NVIDIA driver and it should work right? I rebooted and well I was greeted with the exact same issue. Black screen, nothing responds.\nI don't know what to do, does this card just don't work on Linux at all? That is until I remembered I saw a post on the fediverse that says he can't get NVIDIA KMS to work and he can't use Wayland because of that.\nThis probably have nothing to do with my situation, but my session is set to auto-login to Wayland, maybe newer NVIDIA GPU just don't work with Wayland?\nSo I modified the sddm config so that it would login to the X11 session instead, and yup that worked! (Which basically means I can no longer use the Wayland Session, which have massive performance improvements over X especially after the 5.27 update).</p>\n<p>Also, because NVIDIA is now my main GPU, all my xrandr script no longer works and I have to rely on NVIDIA's decade old &quot;X Server Settings&quot; (That's probably at least around 2008 or something) to tweak it. That settings panel would resize the window itself on some specific tab because apparently scrolling no longer exist. Clicking &quot;Save to X Configuration File&quot; doesn't account for PRIME monitor, and apparently you must launch nvidia-settings on startup just for your color profile to get applied???</p>\n<p>All my existing QEMU VM that utilize virtio gpu also no longer works under UEFI, so I either have to reinstall all of them with Legacy BIOS or just use QXL which is rather slow and not suitable for when I actually need to get stuff done.</p>\n<p>It's just sucks that NVIDIA makes the most advanced and popular GPU, yet they are just uncooperative at everything, making using NVIDIA GPU on Linux second class and devs and user spending more time dealing with NVIDIA specific quirks. This is an inferior product especially in contrast to Red and Blue Team where they both would work out of the box under Linux with absolute 0 configuration, everyone is happy.</p>\n",
			"date_published": "2023-02-26T00:00:00Z"
		}
		,
		{
			"id": "https://blog.lx862.com/blog/2022-12-26-school-computers/",
			"url": "https://blog.lx862.com/blog/2022-12-26-school-computers/",
			"title": "School computers",
			"content_html": "<p>If you are a computer nerd like me, chances are you have messed around with school's computer and see what you can do with it.</p>\n<p>This is just going to be a blog talking about things I've done with school computers during my time studying.</p>\n<h2 id=\"primary-elementary-school\" tabindex=\"-1\">Primary / Elementary School <a class=\"header-anchor\" href=\"https://blog.lx862.com/blog/2022-12-26-school-computers/\">#</a></h2>\n<p>I started falling in love with computers back in year 4, especially the Windows side of things, all simply because of a <a href=\"https://www.youtube.com/watch?v=D3-vBBQKOYU\">Windows error remix</a>.\nBack then I don't have my own computer, then I found something called a Virtual Machine that allows you to emulate different system. My parents was kind enough to let me setup my own Windows XP VM, and I've learnt alot during the process.</p>\n<p>In the computer lab, I would just set the theme from the ugly classic theme my school set to Windows XP's Luna theme and think like I am dealing drugs or something lol. Occasionally I would grab other people's attention, but nothing more than that.</p>\n<h2 id=\"secondary-high-school\" tabindex=\"-1\">Secondary / High School <a class=\"header-anchor\" href=\"https://blog.lx862.com/blog/2022-12-26-school-computers/\">#</a></h2>\n<h3 id=\"year-1\" tabindex=\"-1\">Year 1 <a class=\"header-anchor\" href=\"https://blog.lx862.com/blog/2022-12-26-school-computers/\">#</a></h3>\n<p>At this point I was basically very obsessed with operating system.</p>\n<p>The computer lab runs on like first-gen i7 or something along with Win10, and I was initially very excited.</p>\n<p>...until I realized they did not enable administrator. (Which is the proper thing to do)</p>\n<p>I can't really do anything about it, but on the library there are ~5 computers running Windows XP. A brief look of the specs reveals that it's a pentium 4 machine with 2GB of RAM.</p>\n<p>These thing are slow, very slow, so I thought that destroying them would be a better use than just leaving it alone!</p>\n<p>So one by one I used different method to render the OS unbootable, whether that's by deleting registries, bootloader or System32.</p>\n<p>Like what are the odds they could catch us anyway, the computer will remain normal until they reboot, and by then I am already out of the library!</p>\n<p>Turns out a device called CCTV exist.</p>\n<p>Also, there are 1 instances where I was deleting registries and the computer suddenly hard reset, and it no longer boots.</p>\n<p>Behind me is a student who is queuing up for using this PC because I've literally destroyed the other 4 computer, and now I destroyed the remaining one infront of him.</p>\n<p>So I just uh <i>casually talk to my friend about this and left the library</i>.</p>\n<p>One day later my parents said that the IT department called him, stating that I destroyed the library computer and they have to restore the image. My parent didn't really believe that I would do that, and I obviously did not admit that I destroyed it, and things just ends there. My class teacher are a bit pissed off, but I didn't really receive any punishment for that.</p>\n<h3 id=\"year-2\" tabindex=\"-1\">Year 2 <a class=\"header-anchor\" href=\"https://blog.lx862.com/blog/2022-12-26-school-computers/\">#</a></h3>\n<p>I started taking advantages of breaks between lessons and started doing dumb things like forkbomb on the classroom's computer. (These classroom computers are still running the good old trusty Windows XP, so forkbomb is rather easy to stop)</p>\n<p>Funny enough they actually do not have CCTV installed on the classroom, so I didn't really get caught or anything, and I did not do anything permanent to the PC. It's a rather uneventful year.</p>\n<h3 id=\"year-3\" tabindex=\"-1\">Year 3 <a class=\"header-anchor\" href=\"https://blog.lx862.com/blog/2022-12-26-school-computers/\">#</a></h3>\n<p>At this point I am more in the programming side of stuff and lost interest in just &quot;bricking computers&quot;.</p>\n<p>The class teacher of the 3rd year decided to replace the old XP classroom computer to his own computer which is a 16GB win10 machines, even as to claiming that &quot;<i>The amount of RAM this PC has is 8 classroom computer combined together!</i>&quot;. But at this point I already have my own 16GB machine at my home. He's not wrong, but it's really nothing impressive about it.</p>\n<p>It's also worth noting that the class teacher himself setup the machine, so the default account is not locked down and I can do whatever I want.</p>\n<p>One thing I did notice is that the command prompt for mapping network drive appears on log-in (Where as in other PC does not, although the drive still end up getting mapped anyway), I was intrigued by it, and I started looking deeper to the drive. It's a collection of folders stored by different teacher, some of them even have homework answers in it. I quickly uploaded to my Google Drive account during the breaks. Slowly but surely I've got into the habit of uploading literally anything on that network drive to my school's Google Drive account. (Which has unlimited storage, well at least before Google started killing it off).</p>\n<p>Another thing I noticed is that the class teacher treat this as more of his personal computer than anything else, even as to connecting his OneDrive account to the computer. I took a peak at his OneDrive and noticed that there is a network drive batch file that connects to several other hidden network location, which contains even more homework answers.</p>\n<p>Besides since I now have admin power, I created another Windows user account to upload all the data on that drive in the background during lessons. This is a massive time-save and at one point I racked up around 4TB of data. (Obviously with some duplicated as I upload periodically)</p>\n<p>It's pretty nice but I was hoping one day at least 1 teacher would upload the exam paper answer to the network drive, then I could have a peak at it.</p>\n<p>Fast-forwarding to just days before the last exam of the year, that moment finally arrived. An English teacher uploaded the exam answer for G.E paper and I immediately uploaded it to google drive and shared with my friends.</p>\n<p>My friends are a little bit skeptical, thinking this is too good to be true and didn't bother (And their result are better than me anyway so it doesn't matter). However I still memorized the answer of at least the first page. On the day of the exam, that effort pays off as it is exact same paper. I got the highest mark of the entire class (Although still pretty low, only around ~70/100), and I was happy and guilty at the same time.</p>\n<p>^ So if you're a school IT Admin, or just a teacher reading this for whatever reason, please just use a USB.</p>\n<p>Anyways after that I am still bored. I then have an idea to downloaded <a href=\"https://www.intel.com/content/www/us/en/download/17881/intel-extreme-tuning-utility-intel-xtu.html\">Intel Extreme Tuning Utility (XTU)</a> and dragged the clock speed of the classroom PC all the way down to 800Mhz.</p>\n<p><picture><source type=\"image/avif\" srcset=\"https://blog.lx862.com/img/9isrlb33OC-1400.avif 1400w\"><source type=\"image/webp\" srcset=\"https://blog.lx862.com/img/9isrlb33OC-1400.webp 1400w\"><img alt=\"Intel Extreme Tuning Utility UI\" loading=\"lazy\" decoding=\"async\" src=\"https://blog.lx862.com/img/9isrlb33OC-1400.jpeg\" width=\"1400\" height=\"837\"></picture></p>\n<p>I did this right before the History lesson starts, which is the lesson I probably hate the most. The History teacher ended up waiting 3 and a half minute just to open a photo with the Photo app, it was almost the most powerful and disruptive thing I could've done on every lesson. But I know I can't keep that rolling forever, someone will eventually find out so I just raised the clock speed back to normal. (In-fact it took me around 30 minute just to set it back to the normal speed)</p>\n<p>Anyways at that point I am still thinking what to do in the next year, but I don't reakky have to worry as the last moment I just switched to a vocational education school. (That obviously expertise in Information Technology, given how much of a nerd I am)</p>\n<h2 id=\"a-fresh-start\" tabindex=\"-1\">A fresh start <a class=\"header-anchor\" href=\"https://blog.lx862.com/blog/2022-12-26-school-computers/\">#</a></h2>\n<p>Arriving at the &quot;new&quot; school, I was finally greeted with reasonable computer specs and software. These computers are connected to a domain controller, and the system would be restored everytime the computer boots. Again the user account do have access to administrator privilege, however due to the large amount of professional software installed on the machine that often updates itself, it's not unreasonable to grant it administrator privilege.</p>\n<p>But obviously nothing is bullet proof. For one, there is a hosts files that prevents student from watching youtube or stuff like that, but with admin privilege it has became more easier than ever to just delete it, and now you can watch youtube.</p>\n<p>The task manager is disabled by a classroom management program called &quot;<strong>Lanschool</strong>&quot;. When the teacher client starts, it automatically locks the student's access to the task manager and several other stuff. However we often power our computer on before the teacher arrives, and Lanschool will not kill the task manager that is already opened. So we can use that and terminate the Lanschool program, now we have total control.</p>\n<p>Another method is discovered later to just run <code>taskkill /F /IM student.exe</code> to terminate Lanschool even with it being turned on, then editing group policy to re-enable task manager.</p>\n<p>However I didn't really do this for long. For one it's just annoying? Surely I have better stuff to do than terminating this everytime the lesson starts.</p>\n<p>Second I don't really see the benefit of killing it. I no longer have the interest to do stuff that is against the teacher's/school's rules. And the things they are teaching is rather essential, I usually just pay attention whenever I can.</p>\n<h3 id=\"year-2-1\" tabindex=\"-1\">Year 2 <a class=\"header-anchor\" href=\"https://blog.lx862.com/blog/2022-12-26-school-computers/\">#</a></h3>\n<p>Now that I know these computers are all &quot;connected&quot;, I found out I can command a remote shutdown/restart to anyone, And I can also use msg/psexec to remotely run programs.</p>\n<p>I only did some msgbox for testing, nothing harmful. There's also not alot of free time I could mess around, and I have no reason to not pay attention to the lesson as they all seems to interest me.</p>\n<h3 id=\"year-3-1\" tabindex=\"-1\">Year 3 <a class=\"header-anchor\" href=\"https://blog.lx862.com/blog/2022-12-26-school-computers/\">#</a></h3>\n<p>This is the final year. And there is an computer lessons that just teaches you basic office work and stuff. It's very boring, but at the same time that leaves me with alot of free time.</p>\n<p>I am still intrigued by the ability to remotely execute programs, but the IT Department probably knows about this and they finally turned off Remote Desktop this year.</p>\n<p>I can still shutdown remotely, but nothing more than that. However I soon discovered that you can use the default Windows Task Scheduler to remotely schedule commands, but I couldn't get it to work no matter what.</p>\n<p>Until ~2 weeks ago as of writing this, I was watching through a <a href=\"https://www.youtube.com/watch?v=K4WkdvZ2948\">YouTube video</a> sharing his tech stories at school (Great video btw).</p>\n<p>I saw <a href=\"https://www.youtube.com/watch?v=K4WkdvZ2948&amp;lc=Ugy_iINUwWM-Op733pZ4AaABAg\">this comments (In the highlighted comments section)</a>:</p>\n<p>Someone apparently downloaded the very same classroom software that their school uses, so they have the teacher client and are able to take control of others computer.\nI thought you can only bypass it in some really ancient and badly maintained classroom software and I didn't thought much about it at the time.</p>\n<p>Eventually it got me wondering can I do the same. But I can't download the classroom software (Lanschool) my school uses. My school is 1 major version behind, and I am very uncertain whether that will work.</p>\n<p>In addition I am just against trialware, and given Lanschool is maintained by Lenovo, surely they won't just give you access because you're on the same network right?</p>\n<p>But what if I can copy the client from the teacher's PC? I know I have to find a way to remotely execute some command on their end so I can obtain the file. I quickly realized the whole time I was scheduling the task with the wrong log-in credentials and that's why it did not run the task.</p>\n<p>So I switched to use an local account called <code>kfstud</code> which is setup by the school, presumably in the case where it can't connect to the domain, and now I can finally remotely schedule tasks!</p>\n<p>I still think that it won't be as simple as copying the binaries. There is only 2 lessons left, and I want to at least get something out of it.</p>\n<p>As a compromise I decided to not push my luck, but going to the safer and less impressive approach of viewing and taking control the teacher's PC. That means I would remotely download TightVNC Server to the teacher's PC, install it, then I can connect without raising suspicion.</p>\n<p>This ought to be a faster and more reliable approach that would guarentee success, but well this failed hard probably due to some powershell security policy Microsoft implemented, as such I can't even download anything on their end, I've spent the entire lesson trying to get this work but nope.</p>\n<p>At last I decided to just take a gamble and hope the teacher client will work on my student PC. It's the last lesson anyway, what could I possibily lose?</p>\n<p>Now I need to somehow get it transferred to my computer. My first thought is to copy the Lanschool Program to the network drive (Which is used to hand in homework remotely), then I can obtain it.</p>\n<p>But the account I uses to schedule (kfstud) does not have the network drive mapped, so I can't do that. I soon figured out that you can share a folder in Windows and it will create a network share that anyone can access.</p>\n<p>So I created a new folder and started sharing it. Then I schedule the copy command on teacher's PC and copied the Lanschool folder (<code>C:\\Program Files(x86)\\LanSchool</code>) to my shared folder.</p>\n<p><picture><source type=\"image/avif\" srcset=\"https://blog.lx862.com/img/tfhyNZRnNi-1920.avif 1920w\"><source type=\"image/webp\" srcset=\"https://blog.lx862.com/img/tfhyNZRnNi-1920.webp 1920w\"><img alt=\"Lanschool Teacher Client, captured at that day\" loading=\"lazy\" decoding=\"async\" src=\"https://blog.lx862.com/img/tfhyNZRnNi-1920.jpeg\" width=\"1920\" height=\"1080\"></picture></p>\n<p>And it actually worked! There's no password or anything either, I can even archive the teacher binaries and it will still work.</p>\n<p>This is probably my biggest discovery (At least at this school). Sure it's not like I have to do any hacking 101 or any network sniffing to get it working, and there are almost no barriers preventing me apart from some Windows knowledge. But in the end I am still quite happy about it, just having the teacher client running infront of you feels different.</p>\n<p>Unfortunately it is the last lesson. Looking over my remaining course I can only find 1 computer related course, and it's not even held in any computer lab.</p>\n<p>So that is how it has to end.</p>\n<p>Looking over this again, I can't help but notice that I often do bad stuff with bad intentions on the old school, although it probably make sense given how I gives 0 sh*t to almost any lessons.</p>\n",
			"date_published": "2022-12-26T00:00:00Z"
		}
		
	]
}
